In [1]:
import pandas as pd

print(pd.__version__)

1.1.3

In [4]:
d = {'Team' : ['DC', 'Marvel'], 
     'Heroes' : [['Batman', 'Superman', 'Wonder Women', 'Aquaman', 'Green Latern', 'Shazam'], 
                ['Iron Man', 'Captain America', 'Ant-Man', 'Black Panther', 'Captain Marvel']]}

df= pd.DataFrame(d)
df

     Team                                             Heroes
0      DC  [Batman, Superman, Wonder Women, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...

Explode

In [6]:
df1 = df.explode('Heroes')
df1

     Team           Heroes
0      DC           Batman
0      DC         Superman
0      DC     Wonder Women
0      DC          Aquaman
0      DC     Green Latern
0      DC           Shazam
1  Marvel         Iron Man
1  Marvel  Captain America
1  Marvel          Ant-Man
1  Marvel    Black Panther
1  Marvel   Captain Marvel

Implode

In [7]:
d= {'Team' : ['DC', 'Marvel']}
df2 = pd.DataFrame(d)
df2

     Team
0      DC
1  Marvel

In [10]:
df2['Implode'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2

     Team                                            Implode
0      DC  [Batman, Superman, Wonder Women, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...